; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image4 - mode
	image3 - mode
	image0 - mode
	thermograph1 - mode
	spectrograph5 - mode
	spectrograph2 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph2)
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument1 spectrograph5)
	(supports instrument1 image3)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(have_image Planet5 image0)
	(have_image Planet5 spectrograph2)
	(have_image Planet6 spectrograph5)
	(have_image Star7 image4)
	(have_image Star7 spectrograph2)
	(have_image Phenomenon8 image4)
	(have_image Phenomenon9 spectrograph2)
	(have_image Phenomenon10 image3)
	(have_image Star11 spectrograph2)
))

)

; plan
1. (turn_to satellite1 groundstation3 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 10
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon10 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon10)
   goals met: 0 of 10
5. (turn_to satellite0 groundstation1 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 10
6. (take_image satellite1 phenomenon10 instrument1 image3)
   added: (have_image phenomenon10 image3)
   goals met: 1 of 10
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 10
8. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 10
9. (turn_to satellite0 phenomenon8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 10
10. (take_image satellite0 phenomenon8 instrument0 image4)
   added: (have_image phenomenon8 image4)
   goals met: 2 of 10
11. (turn_to satellite0 phenomenon9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 10
12. (take_image satellite0 phenomenon9 instrument0 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 3 of 10
13. (turn_to satellite0 planet5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet5)
   goals met: 3 of 10
14. (take_image satellite0 planet5 instrument0 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 4 of 10
15. (turn_to satellite0 star11 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star11)
   goals met: 4 of 10
16. (take_image satellite0 star11 instrument0 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 5 of 10
17. (turn_to satellite0 star7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star7)
   goals met: 5 of 10
18. (take_image satellite0 star7 instrument0 image4)
   added: (have_image star7 image4)
   goals met: 6 of 10
19. (take_image satellite0 star7 instrument0 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 7 of 10
20. (turn_to satellite1 planet5 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet5)
   goals met: 7 of 10
21. (take_image satellite1 planet5 instrument1 image0)
   added: (have_image planet5 image0)
   goals met: 8 of 10
22. (turn_to satellite1 planet6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet6)
   goals met: 8 of 10
23. (take_image satellite1 planet6 instrument1 spectrograph5)
   added: (have_image planet6 spectrograph5)
   goals met: 9 of 10
24. (turn_to satellite1 groundstation2 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation2)
   goals met: 10 of 10
